gitcnd/micropython/ports/esp32/boards/OLIMEX_ESP32_POE/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Olimex ESP32 ETH"
#define MICROPY_HW_MCU_NAME "ESP32"

#define MICROPY_PY_DEFLATE_COMPRESS (1)
